[
    {
        "id" : 1,
        "name" : "Українська мова",     
        "Description" : "Тут буде відображатися опис предмету Українська мова. Курс охоплює вивчення граматики, лексики та стилістики української мови. Студенти будуть розвивати навички писемного та усного мовлення, а також вивчатимуть культурні аспекти мови."
    },
    {
        "id" : 2,
        "name" : "Англійська мова",     
        "Description" : "Тут буде відображатися опис предмету Англійська мова. Курс спрямований на розвиток комунікативних навичок, розширення словникового запасу та вивчення професійної англійської мови, необхідної для роботи в ІТ-галузі."
    },
    {
        "id" : 3,
        "name" : "Фізика",     
        "Description" : "Тут буде відображатися опис предмету Фізика. Курс охоплює основні розділи класичної та сучасної фізики, включаючи механіку, термодинаміку, електродинаміку та квантову фізику. Особлива увага приділяється застосуванню фізичних принципів в інженерії та ІТ."
    },
    {
        "id" : 4,
        "name" : "Комп'ютерні мережі",     
        "Description" : "Тут буде відображатися опис предмету Комп'ютерні мережі. Курс включає вивчення основних принципів побудови мереж, протоколів передачі даних, налаштування та адміністрування мережевих систем. Особлива увага приділяється безпеці мереж та сучасним технологіям."
    },
    {
        "id" : 5,
        "name" : "Вища математика",     
        "Description" : "Тут буде відображатися опис предмету Вища математика. Курс охоплює математичний аналіз, лінійну алгебру, диференціальні рівняння та теорію ймовірностей. Студенти вивчатимуть методи математичного моделювання, необхідні для інженерних та ІТ-задач."
    },
    {
        "id" : 6,
        "name" : "Алгоритми та структури даних",
        "Description" : "Курс охоплює основні принципи та методи розробки ефективних алгоритмів і структур даних. Студенти вивчатимуть сортування, пошук, рекурсію, графи, дерева, хешування та інші ключові концепції. Особлива увага приділяється оптимізації алгоритмів та їх застосуванню у розробці програмного забезпечення."
    },
    {
        "id" : 7,
        "name" : "Операційні системи",
        "Description" : "Курс включає вивчення принципів побудови та функціонування операційних систем. Студенти ознайомляться з управлінням процесами, пам'яттю, файловими системами, введенням/виведенням та безпекою ОС. Розглядатимуться приклади сучасних операційних систем, таких як Linux та Windows."
    },
    {
        "id" : 8,
        "name" : "Бази даних",
        "Description" : "Курс присвячений основам проектування, створення та управління базами даних. Студенти вивчатимуть моделі даних, SQL, нормалізацію, індексування, транзакції та забезпечення цілісності даних. Особлива увага приділяється реляційним та нереляційним базам даних, таким як MySQL та MongoDB."
    },
    {
        "id" : 9,
        "name" : "Програмування на Python",
        "Description" : "Курс охоплює основи програмування на мові Python, включаючи синтаксис, структури даних, функції, модулі та об'єктно-орієнтоване програмування. Студенти вивчатимуть застосування Python для автоматизації задач, аналізу даних та розробки веб-додатків."
    },
    {
        "id" : 10,
        "name" : "Машинне навчання",
        "Description" : "Курс включає основні принципи та методи машинного навчання. Студенти ознайомляться з супервізованим та несупервізованим навчанням, алгоритмами класифікації, регресії, кластеризації та зниженням розмірності. Особлива увага приділяється практичному застосуванню алгоритмів машинного навчання за допомогою Python та бібліотек, таких як scikit-learn та TensorFlow."
    },
    {
        "id" : 11,
        "name" : "Розробка веб-додатків",
        "Description" : "Курс присвячений основам розробки веб-додатків з використанням сучасних технологій та фреймворків. Студенти вивчатимуть HTML, CSS, JavaScript, а також серверні мови програмування, такі як Node.js та Django. Особлива увага приділяється створенню адаптивних інтерфейсів користувача та забезпеченню безпеки веб-додатків."
    },
    {
        "id" : 12,
        "name" : "Кібербезпека",
        "Description" : "Курс охоплює основи кібербезпеки, включаючи методи захисту інформаційних систем, криптографію, управління доступом, виявлення та реагування на загрози. Студенти вивчатимуть сучасні технології та інструменти для забезпечення безпеки мереж та додатків."
    },
    {
        "id" : 13,
        "name" : "Програмування на Java",
        "Description" : "Курс включає основи програмування на мові Java, об'єктно-орієнтоване програмування, структури даних та алгоритми. Студенти вивчатимуть розробку десктопних та веб-додатків з використанням Java та фреймворку Spring."
    },
    {
        "id" : 14,
        "name" : "Інженерія програмного забезпечення",
        "Description" : "Курс присвячений методам та практикам розробки програмного забезпечення. Студенти вивчатимуть життєвий цикл розробки, управління проектами, методології Agile та DevOps, тестування та забезпечення якості програмного забезпечення."
    },
    {
        "id" : 15,
        "name" : "Комп'ютерна графіка",
        "Description" : "Курс охоплює основи комп'ютерної графіки, включаючи моделювання, рендеринг, анімацію та обробку зображень. Студенти вивчатимуть використання графічних API, таких як OpenGL та WebGL, для створення інтерактивних 3D-додатків."
    },
    {
        "id" : 16,
        "name" : "Інтернет речей (IoT)",
        "Description" : "Курс включає вивчення концепцій та технологій Інтернету речей. Студенти ознайомляться з апаратним забезпеченням, протоколами зв'язку, хмарними платформами та безпекою IoT. Особлива увага приділяється розробці та інтеграції IoT-рішень для різних галузей."
    },
    {
        "id" : 17,
        "name" : "Розподілені системи",
        "Description" : "Курс присвячений основам розподілених систем, включаючи архітектуру, алгоритми та протоколи. Студенти вивчатимуть масштабування, управління ресурсами, узгодження даних та забезпечення відмовостійкості у розподілених середовищах."
    },
    {
        "id" : 18,
        "name" : "Веб-технології",
        "Description" : "Курс охоплює сучасні веб-технології, такі як HTML5, CSS3, JavaScript, фреймворки Angular та React. Студенти вивчатимуть розробку динамічних та інтерактивних веб-додатків, а також технології серверної частини, такі як Node.js та Django."
    },
    {
        "id" : 19,
        "name" : "Хмарні обчислення",
        "Description" : "Курс включає вивчення основ хмарних обчислень, включаючи моделі SaaS, PaaS та IaaS. Студенти ознайомляться з провідними хмарними платформами, такими як AWS, Azure та Google Cloud, а також з методами розробки та розгортання хмарних додатків."
    },
    {
        "id" : 20,
        "name" : "Системи штучного інтелекту",
        "Description" : "Курс присвячений вивченню принципів та методів розробки систем штучного інтелекту. Студенти вивчатимуть машинне навчання, нейронні мережі, обробку природної мови та комп'ютерний зір. Особлива увага приділяється практичному застосуванню алгоритмів та технологій штучного інтелекту."
    },
    {
        "id" : 21,
        "name" : "Мікроконтролери та вбудовані системи",
        "Description" : "Курс охоплює основи розробки та програмування вбудованих систем з використанням мікроконтролерів. Студенти вивчатимуть архітектуру мікроконтролерів, інтерфейсування з периферійними пристроями, реальний час та оптимізацію програмного забезпечення для вбудованих систем."
    },
    {
        "id" : 22,
        "name" : "Розробка мобільних додатків",
        "Description" : "Курс включає вивчення основ розробки мобільних додатків для платформ iOS та Android. Студенти вивчатимуть мови програмування Swift та Kotlin, фреймворки для розробки мобільних додатків, а також принципи проектування інтерфейсів користувача та забезпечення безпеки мобільних додатків."
    },
    {
        "id" : 23,
        "name" : "Віртуальна та доповнена реальність",
        "Description" : "Курс охоплює основи технологій віртуальної та доповненої реальності. Студенти вивчатимуть принципи створення VR/AR-додатків, використання відповідних апаратних засобів та програмного забезпечення, а також прикладне застосування VR/AR у різних галузях."
    },
    {
        "id" : 24,
        "name" : "Робототехніка",
        "Description" : "Курс присвячений основам робототехніки, включаючи механіку, електроніку, програмування та управління роботами. Студенти вивчатимуть різні типи роботів, датчики, виконавчі механізми та алгоритми автономної навігації та взаємодії з середовищем."
    },
    {
        "id" : 25,
        "name" : "Системне програмування",
        "Description" : "Курс включає вивчення основ системного програмування, включаючи розробку драйверів, системних утиліт та інструментів. Студенти вивчатимуть низькорівневе програмування, взаємодію з апаратним забезпеченням, а також оптимізацію продуктивності та безпеки системного програмного забезпечення."
    },
    {
        "id" : 26,
        "name" : "Інформаційна безпека",
        "Description" : "Курс охоплює основи інформаційної безпеки, включаючи методи захисту даних, управління ризиками, розробку політик безпеки та відповідність стандартам. Студенти вивчатимуть криптографію, мережеву безпеку, управління інцидентами та аналіз загроз."
    },
    {
        "id" : 27,
        "name" : "Біоінформатика",
        "Description" : "Курс присвячений застосуванню інформаційних технологій та алгоритмів для аналізу біологічних даних. Студенти вивчатимуть методи секвенування ДНК, аналіз геномів, моделювання біологічних систем та розробку інструментів для біоінформатики."
    },
    {
        "id" : 28,
        "name" : "Аналітика даних",
        "Description" : "Курс включає основи аналізу даних, включаючи методи збору, обробки, візуалізації та інтерпретації даних. Студенти вивчатимуть статистичні методи, машинне навчання, використання інструментів для аналізу даних, таких як Python, R та SQL, а також принципи побудови дашбордів та звітів."
    },
    {
        "id" : 29,
        "name" : "Комп'ютерне моделювання",
        "Description" : "Курс охоплює основи комп'ютерного моделювання та симуляції складних систем. Студенти вивчатимуть методи моделювання фізичних, біологічних та соціальних систем, використання спеціалізованого програмного забезпечення та аналіз результатів симуляцій."
    },
    {
        "id" : 30,
        "name" : "Проектування та розробка ІТ-систем",
        "Description" : "Курс присвячений методам та інструментам проектування складних ІТ-систем. Студенти вивчатимуть системний аналіз, UML, управління вимогами, проектування архітектури систем та інтеграцію програмних компонентів. Особлива увага приділяється принципам розробки надійних та масштабованих ІТ-рішень."
    },
    {
        "id" : 31,
        "name" : "Мобільні та бездротові комунікації",
        "Description" : "Курс охоплює основи мобільних та бездротових комунікацій, включаючи архітектуру мереж, протоколи передачі даних, стандарти мобільного зв'язку (3G, 4G, 5G) та технології бездротового доступу. Студенти вивчатимуть принципи проектування та налаштування мобільних мереж."
    },
    {
        "id" : 32,
        "name" : "Програмування на C++",
        "Description" : "Курс включає основи програмування на мові C++, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та шаблони. Студенти вивчатимуть розробку ефективних програмних рішень для різних галузей, а також оптимізацію продуктивності коду."
    },
    {
        "id" : 33,
        "name" : "Методи оптимізації",
        "Description" : "Курс охоплює основи методів оптимізації, включаючи лінійне та нелінійне програмування, оптимізацію на графах, евристичні методи та алгоритми пошуку. Студенти вивчатимуть застосування методів оптимізації у розробці програмного забезпечення та інженерних задачах."
    },
    {
        "id" : 34,
        "name" : "Дослідження операцій",
        "Description" : "Курс включає основи дослідження операцій, включаючи моделювання та аналіз складних систем, управління запасами, оптимізацію виробничих процесів та управління проектами. Студенти вивчатимуть математичні методи та алгоритми для вирішення операційних задач."
    },
    {
        "id" : 35,
        "name" : "Теорія інформації",
        "Description" : "Курс охоплює основи теорії інформації, включаючи кодування, ентропію, міркування про інформаційні процеси та криптографію. Студенти вивчатимуть принципи передачі та збереження інформації, а також алгоритми шифрування та декодування даних."
    },
    {
        "id" : 36,
        "name" : "Лабораторія програмування",
        "Description" : "Курс присвячений практичним аспектам програмування, включаючи розробку, тестування та налагодження програмного забезпечення. Студенти вивчатимуть сучасні інструменти та методології розробки, а також реалізацію проектів на основі реальних вимог."
    },
    {
        "id" : 37,
        "name" : "Системи розпізнавання образів",
        "Description" : "Курс включає основи розпізнавання образів, включаючи алгоритми обробки зображень, комп'ютерний зір, машинне навчання та нейронні мережі. Студенти вивчатимуть методи аналізу та інтерпретації візуальних даних для різних застосувань, таких як автоматичне розпізнавання тексту та об'єктів."
    },
    {
        "id" : 38,
        "name" : "Інформаційні системи та бази даних",
        "Description" : "Курс охоплює основи проектування та управління інформаційними системами та базами даних. Студенти вивчатимуть методи моделювання даних, управління базами даних, розробку інформаційних систем та забезпечення цілісності та безпеки даних."
    },
    {
        "id" : 39,
        "name" : "Технології програмування",
        "Description" : "Курс включає вивчення сучасних технологій та методологій програмування. Студенти вивчатимуть різні мови програмування, фреймворки, інструменти розробки, а також принципи проектування та розробки програмного забезпечення з урахуванням вимог замовників."
    },
    {
        "id" : 40,
        "name" : "Мережеве програмування",
        "Description" : "Курс присвячений основам мережевого програмування, включаючи принципи взаємодії між комп'ютерами в мережі, протоколи передачі даних, розробку мережевих додатків та налаштування мережевих служб. Студенти вивчатимуть використання бібліотек та фреймворків для реалізації мережевих рішень."
    },
    {
        "id" : 41,
        "name" : "Розробка ігор",
        "Description" : "Курс охоплює основи розробки комп'ютерних ігор, включаючи програмування, дизайн, анімацію та звукове оформлення. Студенти вивчатимуть використання ігрових рушіїв, таких як Unity та Unreal Engine, для створення інтерактивних та захоплюючих ігрових проектів."
    },
    {
        "id" : 42,
        "name" : "Обробка природної мови",
        "Description" : "Курс включає основи обробки природної мови (NLP), включаючи лінгвістичний аналіз, машинне навчання для NLP, автоматичний переклад, аналіз тональності тексту та розпізнавання мови. Студенти вивчатимуть використання бібліотек та інструментів для NLP, таких як NLTK та spaCy."
    },
    {
        "id" : 43,
        "name" : "Квантові обчислення",
        "Description" : "Курс присвячений основам квантових обчислень, включаючи принципи квантової механіки, квантові алгоритми та квантові комп'ютери. Студенти вивчатимуть перспективи застосування квантових обчислень для вирішення складних задач у різних галузях, таких як криптографія та оптимізація."
    },
    {
        "id" : 44,
        "name" : "Електроніка та цифрові схеми",
        "Description" : "Курс охоплює основи електроніки та проектування цифрових схем. Студенти вивчатимуть компоненти електронних систем, логічні елементи, цифрові схеми, методи проектування та тестування електронних пристроїв."
    },
    {
        "id" : 45,
        "name" : "Соціальні мережі та аналіз даних",
        "Description" : "Курс включає вивчення принципів роботи соціальних мереж, аналізу даних, зібраних з соціальних платформ, методи аналізу соціальних мереж та їх застосування у маркетингу, управлінні репутацією та соціальних дослідженнях."
    },
    {
        "id" : 46,
        "name" : "Геоінформаційні системи (ГІС)",
        "Description" : "Курс охоплює основи геоінформаційних систем, включаючи збирання, зберігання, аналіз та візуалізацію просторових даних. Студенти вивчатимуть використання програмного забезпечення для ГІС, таких як ArcGIS та QGIS, для створення карт та аналізу географічних даних."
    },
    {
        "id" : 47,
        "name" : "Нанотехнології",
        "Description" : "Курс присвячений основам нанотехнологій, включаючи розробку та застосування наноматеріалів, наноструктур та нанопристроїв. Студенти вивчатимуть фізичні та хімічні властивості наноматеріалів, методи їх синтезу та застосування у різних галузях науки та техніки."
    },
    {
        "id" : 48,
        "name" : "Відновлювані джерела енергії",
        "Description" : "Курс включає основи відновлюваних джерел енергії, включаючи сонячну, вітрову, гідроенергію та біомасу. Студенти вивчатимуть принципи роботи, проектування та застосування систем відновлюваної енергії, а також їх вплив на навколишнє середовище та економіку."
    },
    {
        "id" : 49,
        "name" : "Аналіз великих даних",
        "Description" : "Курс охоплює основи аналізу великих даних, включаючи методи збору, зберігання, обробки та аналізу великих обсягів інформації. Студенти вивчатимуть технології та інструменти для роботи з великими даними, такі як Hadoop, Spark, NoSQL бази даних та методи машинного навчання для аналізу даних."
    },
    {
        "id" : 50,
        "name" : "Проектування мікропроцесорних систем",
        "Description" : "Курс включає вивчення основ проектування та програмування мікропроцесорних систем. Студенти вивчатимуть архітектуру мікропроцесорів, принципи роботи, інтерфейси та програмування на асемблері та мовах високого рівня для створення ефективних мікропроцесорних рішень."
    },
    {
        "id" : 51,
        "name" : "Системи управління базами даних",
        "Description" : "Курс охоплює основи систем управління базами даних (СУБД), включаючи проектування, створення, адміністрування та оптимізацію баз даних. Студенти вивчатимуть реляційні та нереляційні моделі даних, мови запитів SQL та NoSQL, а також методи забезпечення цілісності та безпеки даних."
    },
    {
        "id" : 52,
        "name" : "Методи обчислювальної геометрії",
        "Description" : "Курс включає основи обчислювальної геометрії, включаючи алгоритми для обробки геометричних об'єктів, розпізнавання образів, графічних та анімаційних додатків. Студенти вивчатимуть структури даних та алгоритми для роботи з геометричними об'єктами, такими як точки, лінії, багатокутники та поверхні."
    },
    {
        "id" : 53,
        "name" : "Програмування на Rust",
        "Description" : "Курс присвячений основам програмування на мові Rust, включаючи синтаксис, структури даних, системне програмування та розробку безпечних програм. Студенти вивчатимуть особливості мови Rust, такі як управління пам'яттю, конкурентність та безпечність, а також її застосування у розробці системного та прикладного програмного забезпечення."
    },
    {
        "id" : 54,
        "name" : "Тестування програмного забезпечення",
        "Description" : "Курс охоплює основи тестування програмного забезпечення, включаючи методи та інструменти для забезпечення якості ПЗ. Студенти вивчатимуть різні види тестування, такі як модульне, інтеграційне, системне та приймальне тестування, а також автоматизацію тестування з використанням сучасних інструментів."
    },
    {
        "id" : 55,
        "name" : "Програмування на Go",
        "Description" : "Курс включає основи програмування на мові Go, включаючи синтаксис, структури даних, конкурентність та розробку ефективних програм. Студенти вивчатимуть особливості мови Go, такі як простота, продуктивність та масштабованість, а також її застосування у розробці серверного програмного забезпечення."
    },
    {
        "id" : 56,
        "name" : "Мікросервісна архітектура",
        "Description" : "Курс присвячений основам мікросервісної архітектури, включаючи принципи проектування, розробки, розгортання та управління мікросервісами. Студенти вивчатимуть технології контейнеризації, оркестрації, моніторингу та забезпечення безпеки мікросервісних додатків."
    },
    {
        "id" : 57,
        "name" : "Блокчейн та криптовалюти",
        "Description" : "Курс охоплює основи технології блокчейн та криптовалют, включаючи принципи децентралізованих систем, криптографічні методи, механізми консенсусу та розробку смарт-контрактів. Студенти вивчатимуть застосування блокчейну у фінансових та інших галузях, а також проблеми та перспективи розвитку цієї технології."
    },
    {
        "id" : 58,
        "name" : "Інтерактивні медіа",
        "Description" : "Курс включає вивчення принципів створення інтерактивних медіа, включаючи анімацію, мультимедіа, веб-дизайн та розробку ігрових додатків. Студенти вивчатимуть технології та інструменти для створення інтерактивного контенту, такі як HTML5, CSS3, JavaScript та ігрові рушії."
    },
    {
        "id" : 59,
        "name" : "Машинне навчання для бізнесу",
        "Description" : "Курс присвячений застосуванню методів машинного навчання у бізнесі, включаючи аналіз даних, прогнозування, оптимізацію та автоматизацію процесів. Студенти вивчатимуть практичні аспекти використання алгоритмів машинного навчання для вирішення бізнес-завдань, а також використання інструментів, таких як Python та R."
    },
    {
        "id" : 60,
        "name" : "Програмування на Swift",
        "Description" : "Курс охоплює основи програмування на мові Swift, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку додатків для iOS. Студенти вивчатимуть особливості мови Swift, такі як безпечність, продуктивність та простота використання, а також розробку мобільних додатків з використанням фреймворку SwiftUI."
    },
    {
        "id" : 61,
        "name" : "Комп'ютерна криміналістика",
        "Description" : "Курс включає основи комп'ютерної криміналістики, включаючи методи збору, аналізу та збереження цифрових доказів. Студенти вивчатимуть інструменти та технології для розслідування комп'ютерних злочинів, аналізу мережевого трафіку, відновлення даних та забезпечення їх цілісності."
    },
    {
        "id" : 62,
        "name" : "Проектування інтерфейсів користувача",
        "Description" : "Курс охоплює основи проектування інтерфейсів користувача, включаючи принципи юзабіліті, ергономіки, дизайну інтерфейсів та взаємодії людина-комп'ютер. Студенти вивчатимуть методи створення зручних та ефективних інтерфейсів, використання прототипування та тестування користувацького досвіду."
    },
    {
        "id" : 63,
        "name" : "Моделювання та аналіз бізнес-процесів",
        "Description" : "Курс присвячений моделюванню та аналізу бізнес-процесів, включаючи методи оптимізації, автоматизації та управління бізнес-процесами. Студенти вивчатимуть інструменти для моделювання бізнес-процесів, такі як BPMN, та їх застосування для підвищення ефективності організації."
    },
    {
        "id" : 64,
        "name" : "Комп'ютерна архітектура",
        "Description" : "Курс включає вивчення основ комп'ютерної архітектури, включаючи структуру та організацію комп'ютерних систем, процесорів, пам'яті, введення/виведення та системних шин. Студенти вивчатимуть принципи роботи комп'ютерних систем, їх проектування та оптимізацію продуктивності."
    },
    {
        "id" : 65,
        "name" : "Моделювання віртуальних середовищ",
        "Description" : "Курс охоплює основи моделювання віртуальних середовищ, включаючи створення 3D-моделей, анімацію, симуляцію фізичних процесів та інтерактивність. Студенти вивчатимуть використання програмного забезпечення для створення віртуальних світів, таких як Blender та Unity."
    },
    {
        "id" : 66,
        "name" : "Системи підтримки прийняття рішень",
        "Description" : "Курс присвячений основам систем підтримки прийняття рішень (СППР), включаючи методи аналізу даних, моделювання, оптимізації та використання СППР у бізнесі. Студенти вивчатимуть інструменти для створення СППР, такі як Excel, Python та спеціалізоване програмне забезпечення."
    },
    {
        "id" : 67,
        "name" : "Програмування на Ruby",
        "Description" : "Курс включає основи програмування на мові Ruby, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку веб-додатків з використанням фреймворку Ruby on Rails. Студенти вивчатимуть особливості мови Ruby, такі як простота, гнучкість та ефективність, а також розробку веб-додатків."
    },
    {
        "id" : 68,
        "name" : "Аналітика соціальних медіа",
        "Description" : "Курс охоплює основи аналітики соціальних медіа, включаючи методи збору, обробки та аналізу даних з соціальних платформ. Студенти вивчатимуть інструменти для аналізу соціальних медіа, такі як Google Analytics, Hootsuite та спеціалізоване програмне забезпечення, а також застосування отриманих даних для маркетингових стратегій."
    },
    {
        "id" : 69,
        "name" : "Біометричні системи",
        "Description" : "Курс включає вивчення основ біометричних систем, включаючи методи ідентифікації та автентифікації на основі фізичних та поведінкових характеристик. Студенти вивчатимуть технології розпізнавання обличчя, відбитків пальців, райдужної оболонки ока та голосу, а також питання безпеки та конфіденційності біометричних даних."
    },
    {
        "id" : 70,
        "name" : "Проектування кіберфізичних систем",
        "Description" : "Курс охоплює основи проектування кіберфізичних систем, включаючи інтеграцію фізичних процесів з комп'ютерними системами для управління та моніторингу. Студенти вивчатимуть принципи роботи кіберфізичних систем, методи проектування та застосування у різних галузях, таких як промисловість, медицина та транспорт."
    },
    {
        "id" : 71,
        "name" : "Обробка сигналів та зображень",
        "Description" : "Курс охоплює основи обробки сигналів та зображень, включаючи методи фільтрації, аналізу спектра, компресії та реконструкції сигналів. Студенти вивчатимуть застосування алгоритмів обробки сигналів у різних галузях, таких як телекомунікації, медицина та комп'ютерний зір."
    },
    {
        "id" : 72,
        "name" : "Математичне моделювання",
        "Description" : "Курс включає основи математичного моделювання, включаючи методи створення математичних моделей фізичних, біологічних та соціальних систем. Студенти вивчатимуть аналітичні та чисельні методи моделювання, використання програмного забезпечення для симуляцій та аналіз результатів моделювання."
    },
    {
        "id" : 73,
        "name" : "Етика в інформаційних технологіях",
        "Description" : "Курс присвячений етичним питанням в інформаційних технологіях, включаючи питання конфіденційності, безпеки даних, інтелектуальної власності та соціальної відповідальності. Студенти вивчатимуть етичні дилеми, що виникають при розробці та використанні ІТ-технологій, та шляхи їх вирішення."
    },
    {
        "id" : 74,
        "name" : "Інноваційні технології в ІТ",
        "Description" : "Курс охоплює сучасні інноваційні технології в галузі інформаційних технологій, включаючи штучний інтелект, блокчейн, Інтернет речей, віртуальну та доповнену реальність. Студенти вивчатимуть перспективи розвитку та застосування інноваційних технологій у різних галузях."
    },
    {
        "id" : 75,
        "name" : "Програмування на Kotlin",
        "Description" : "Курс включає основи програмування на мові Kotlin, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку додатків для Android. Студенти вивчатимуть особливості мови Kotlin, її інтеграцію з Java та застосування у розробці сучасних мобільних додатків."
    },
    {
        "id" : 76,
        "name" : "Технології віртуалізації",
        "Description" : "Курс охоплює основи технологій віртуалізації, включаючи принципи роботи, архітектуру та застосування віртуальних машин. Студенти вивчатимуть платформи віртуалізації, такі як VMware, Hyper-V та KVM, а також методи управління та забезпечення безпеки віртуалізованих середовищ."
    },
    {
        "id" : 77,
        "name" : "Проектування інтегральних схем",
        "Description" : "Курс включає основи проектування інтегральних схем, включаючи методи створення цифрових та аналогових інтегральних схем. Студенти вивчатимуть процеси розробки, виробництва та тестування інтегральних схем, а також використання спеціалізованого програмного забезпечення для їх проектування."
    },
    {
        "id" : 78,
        "name" : "Системи управління підприємством (ERP)",
        "Description" : "Курс присвячений системам управління підприємством (ERP), включаючи принципи роботи, архітектуру та застосування ERP-систем. Студенти вивчатимуть модулі ERP-систем для управління фінансами, виробництвом, логістикою та людськими ресурсами, а також методи впровадження та налаштування ERP-систем."
    },
    {
        "id" : 79,
        "name" : "Аналіз даних за допомогою Python",
        "Description" : "Курс включає основи аналізу даних за допомогою мови програмування Python, включаючи методи збору, обробки та візуалізації даних. Студенти вивчатимуть використання бібліотек для аналізу даних, таких як Pandas, NumPy, Matplotlib та Seaborn, а також методи машинного навчання для аналізу даних."
    },
    {
        "id" : 80,
        "name" : "Квантова криптографія",
        "Description" : "Курс охоплює основи квантової криптографії, включаючи принципи квантової механіки, методи шифрування та протоколи передачі квантових ключів. Студенти вивчатимуть перспективи застосування квантової криптографії для забезпечення безпеки інформаційних систем."
    },
    {
        "id" : 81,
        "name" : "Соціальна інженерія",
        "Description" : "Курс присвячений основам соціальної інженерії, включаючи методи психологічного впливу та маніпуляції для отримання конфіденційної інформації. Студенти вивчатимуть способи захисту від соціальної інженерії, а також методи навчання співробітників для підвищення їхньої безпеки."
    },
    {
        "id" : 82,
        "name" : "Інтернет речей для промисловості",
        "Description" : "Курс охоплює основи Інтернету речей (IoT) у промисловості, включаючи методи збирання, обробки та аналізу даних з промислових об'єктів. Студенти вивчатимуть технології та протоколи для створення IoT-рішень, а також застосування IoT для моніторингу та управління виробничими процесами."
    },
    {
        "id" : 83,
        "name" : "Дослідження штучного інтелекту",
        "Description" : "Курс включає основи дослідження штучного інтелекту, включаючи методи машинного навчання, нейронні мережі, алгоритми оптимізації та обробку природної мови. Студенти вивчатимуть сучасні досягнення у галузі штучного інтелекту та їх застосування для вирішення різноманітних задач."
    },
    {
        "id" : 84,
        "name" : "Криптографія та мережева безпека",
        "Description" : "Курс присвячений основам криптографії та мережевої безпеки, включаючи методи шифрування, криптографічні протоколи, аутентифікацію та захист мереж від атак. Студенти вивчатимуть застосування криптографії для забезпечення конфіденційності, цілісності та автентичності даних у мережах."
    },
    {
        "id" : 85,
        "name" : "Програмування на JavaScript",
        "Description" : "Курс включає основи програмування на мові JavaScript, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку веб-додатків. Студенти вивчатимуть використання бібліотек та фреймворків, таких як React, Angular та Node.js, для створення сучасних веб-додатків."
    },
    {
        "id" : 86,
        "name" : "Високопродуктивні обчислення",
        "Description" : "Курс охоплює основи високопродуктивних обчислень, включаючи архітектуру суперкомп'ютерів, паралельне програмування, алгоритми для високопродуктивних обчислень та оптимізацію продуктивності. Студенти вивчатимуть використання сучасних платформ та інструментів для вирішення складних обчислювальних задач."
    },
    {
        "id" : 87,
        "name" : "Системи розподілених баз даних",
        "Description" : "Курс включає основи систем розподілених баз даних, включаючи методи зберігання, управління та забезпечення узгодженості даних у розподілених системах. Студенти вивчатимуть архітектури розподілених баз даних, протоколи реплікації та шардінгу, а також методи забезпечення високої доступності даних."
    },
    {
        "id" : 88,
        "name" : "Проектування вбудованих систем",
        "Description" : "Курс охоплює основи проектування вбудованих систем, включаючи апаратне та програмне забезпечення для вбудованих рішень. Студенти вивчатимуть методи проектування, оптимізації та тестування вбудованих систем для різних застосувань, таких як автомобільна промисловість, робототехніка та інтернет речей."
    },
    {
        "id" : 89,
        "name" : "Моделювання та симуляція систем",
        "Description" : "Курс включає основи моделювання та симуляції систем, включаючи методи створення моделей фізичних, біологічних та соціальних систем. Студенти вивчатимуть використання програмного забезпечення для симуляцій, таких як MATLAB та Simulink, для аналізу та оптимізації систем."
    },
    {
        "id" : 90,
        "name" : "Програмування на PHP",
        "Description" : "Курс присвячений основам програмування на мові PHP, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку веб-додатків. Студенти вивчатимуть використання фреймворків, таких як Laravel та Symfony, для створення масштабованих та безпечних веб-додатків."
    },
    {
        "id" : 91,
        "name" : "Системи автоматизації",
        "Description" : "Курс охоплює основи систем автоматизації, включаючи принципи роботи, архітектуру та застосування автоматизованих систем. Студенти вивчатимуть технології та протоколи для створення систем автоматизації, а також методи управління та моніторингу автоматизованих процесів."
    },
    {
        "id" : 92,
        "name" : "Методи та інструменти програмної інженерії",
        "Description" : "Курс включає основи методів та інструментів програмної інженерії, включаючи розробку, тестування, впровадження та обслуговування програмного забезпечення. Студенти вивчатимуть сучасні методології розробки ПЗ, такі як Agile та DevOps, а також інструменти для управління проектами та забезпечення якості ПЗ."
    },
    {
        "id" : 93,
        "name" : "Програмування на R",
        "Description" : "Курс присвячений основам програмування на мові R, включаючи синтаксис, структури даних та методи аналізу даних. Студенти вивчатимуть використання R для статистичного аналізу, візуалізації даних та побудови моделей машинного навчання, а також застосування R у різних галузях, таких як біоінформатика та економіка."
    },
    {
        "id" : 94,
        "name" : "Географічні інформаційні системи (ГІС)",
        "Description" : "Курс охоплює основи географічних інформаційних систем (ГІС), включаючи збирання, зберігання, аналіз та візуалізацію просторових даних. Студенти вивчатимуть використання програмного забезпечення для ГІС, таких як ArcGIS та QGIS, для створення карт та аналізу географічних даних."
    },
    {
        "id" : 95,
        "name" : "Системи реального часу",
        "Description" : "Курс включає основи систем реального часу, включаючи принципи роботи, архітектуру та застосування. Студенти вивчатимуть методи розробки, тестування та оптимізації систем реального часу для забезпечення надійності та безпеки в різних галузях, таких як автомобільна промисловість та авіація."
    },
    {
        "id" : 96,
        "name" : "Технології великих даних",
        "Description" : "Курс присвячений основам технологій великих даних, включаючи методи збирання, зберігання, обробки та аналізу великих обсягів даних. Студенти вивчатимуть використання сучасних платформ та інструментів для роботи з великими даними, таких як Hadoop, Spark та NoSQL бази даних."
    },
    {
        "id" : 97,
        "name" : "Вбудовані операційні системи",
        "Description" : "Курс охоплює основи вбудованих операційних систем, включаючи принципи роботи, архітектуру та методи розробки. Студенти вивчатимуть використання вбудованих ОС, таких як FreeRTOS та VxWorks, для створення надійних та ефективних вбудованих рішень."
    },
    {
        "id" : 98,
        "name" : "Аналіз та візуалізація даних",
        "Description" : "Курс включає основи аналізу та візуалізації даних, включаючи методи обробки, аналізу та представлення даних. Студенти вивчатимуть використання сучасних інструментів для аналізу та візуалізації даних, таких як Tableau, Power BI та Python, для створення зрозумілих та інформативних дашбордів та звітів."
    },
    {
        "id" : 99,
        "name" : "Методи оптимізації в інженерії",
        "Description" : "Курс присвячений методам оптимізації, включаючи лінійне та нелінійне програмування, стохастичні методи, генетичні алгоритми та евристики. Студенти вивчатимуть застосування методів оптимізації для вирішення інженерних задач та розробки ефективних рішень."
    },
    {
        "id" : 100,
        "name" : "Інтернет безпеки та конфіденційності",
        "Description" : "Курс охоплює основи інтернет безпеки та конфіденційності, включаючи методи захисту даних, управління ризиками та розробку політик безпеки. Студенти вивчатимуть сучасні загрози безпеці, такі як кіберзлочинність, та методи їх нейтралізації для забезпечення безпеки та конфіденційності в інтернеті."
    },
    {
        "id" : 101,
        "name" : "Технології паралельних обчислень",
        "Description" : "Курс включає основи паралельних обчислень, включаючи архітектуру паралельних систем, алгоритми та моделі паралельних обчислень. Студенти вивчатимуть методи програмування паралельних систем, використання сучасних платформ та інструментів, таких як MPI та OpenMP, для вирішення складних обчислювальних задач."
    },
    {
        "id" : 102,
        "name" : "Розробка та тестування API",
        "Description" : "Курс присвячений розробці та тестуванню програмних інтерфейсів (API), включаючи принципи проектування, реалізації та забезпечення безпеки. Студенти вивчатимуть методи створення RESTful та GraphQL API, використання сучасних інструментів для тестування та документації API."
    },
    {
        "id" : 103,
        "name" : "Візуалізація інформації",
        "Description" : "Курс охоплює основи візуалізації інформації, включаючи методи представлення даних у вигляді графіків, діаграм та інтерактивних дашбордів. Студенти вивчатимуть використання сучасних інструментів для візуалізації даних, таких як D3.js, Power BI та Tableau, для створення зрозумілих та ефективних візуалізацій."
    },
    {
        "id" : 104,
        "name" : "Програмування на TypeScript",
        "Description" : "Курс включає основи програмування на мові TypeScript, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку веб-додатків. Студенти вивчатимуть використання TypeScript у поєднанні з JavaScript та фреймворками, такими як Angular та React, для створення масштабованих та безпечних веб-додатків."
    },
    {
        "id" : 105,
        "name" : "Інтелектуальні системи управління",
        "Description" : "Курс присвячений основам інтелектуальних систем управління, включаючи методи штучного інтелекту, машинного навчання та оптимізації. Студенти вивчатимуть застосування інтелектуальних систем управління для автоматизації та оптимізації різних процесів, таких як виробництво, логістика та управління енергетичними системами."
    },
    {
        "id" : 106,
        "name" : "Розробка чат-ботів",
        "Description" : "Курс охоплює основи розробки чат-ботів, включаючи принципи роботи, архітектуру та технології для створення інтерактивних бото-систем. Студенти вивчатимуть використання платформ, таких як Dialogflow, Microsoft Bot Framework та Rasa, для розробки чат-ботів для різних застосувань, таких як підтримка клієнтів, автоматизація процесів та маркетинг."
    },
    {
        "id" : 107,
        "name" : "Програмування на Dart",
        "Description" : "Курс включає основи програмування на мові Dart, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку додатків з використанням фреймворку Flutter. Студенти вивчатимуть особливості мови Dart, її інтеграцію з іншими мовами та застосування для створення кросплатформених мобільних додатків."
    },
    {
        "id" : 108,
        "name" : "Автоматизація тестування програмного забезпечення",
        "Description" : "Курс присвячений основам автоматизації тестування програмного забезпечення, включаючи методи розробки автоматизованих тестів, використання інструментів для автоматизації та забезпечення якості ПЗ. Студенти вивчатимуть використання таких інструментів, як Selenium, JUnit та TestNG, для створення надійних та ефективних автоматизованих тестів."
    },
    {
        "id" : 109,
        "name" : "Розробка мікросервісів на Java",
        "Description" : "Курс охоплює основи розробки мікросервісів на мові Java, включаючи принципи проектування, реалізації та розгортання мікросервісних архітектур. Студенти вивчатимуть використання фреймворків, таких як Spring Boot та Spring Cloud, для створення масштабованих та надійних мікросервісів."
    },
    {
        "id" : 110,
        "name" : "Аналіз бізнес-даних",
        "Description" : "Курс включає основи аналізу бізнес-даних, включаючи методи збору, обробки та аналізу даних для прийняття бізнес-рішень. Студенти вивчатимуть використання інструментів для аналізу даних, таких як Excel, SQL та Python, для створення дашбордів, звітів та прогнозів."
    },
    {
        "id" : 111,
        "name" : "Інтернет речей (IoT) та його застосування",
        "Description" : "Курс присвячений основам Інтернету речей (IoT) та його застосуванню у різних галузях, включаючи розробку IoT-пристроїв, протоколи зв'язку та хмарні платформи. Студенти вивчатимуть використання технологій IoT для створення розумних будинків, промислових автоматизованих систем та медичних пристроїв."
    },
    {
        "id" : 112,
        "name" : "Програмування на Scala",
        "Description" : "Курс включає основи програмування на мові Scala, включаючи синтаксис, структури даних, функціональне та об'єктно-орієнтоване програмування. Студенти вивчатимуть використання Scala для розробки масштабованих додатків, а також її інтеграцію з іншими мовами, такими як Java."
    },
    {
        "id" : 113,
        "name" : "Веб-розробка на Node.js",
        "Description" : "Курс охоплює основи веб-розробки на платформі Node.js, включаючи розробку серверних додатків, роботу з базами даних та створення API. Студенти вивчатимуть використання фреймворків, таких як Express.js, для створення масштабованих та продуктивних веб-додатків."
    },
    {
        "id" : 114,
        "name" : "Інженерія знань",
        "Description" : "Курс присвячений основам інженерії знань, включаючи методи збирання, структурування, збереження та використання знань для створення інтелектуальних систем. Студенти вивчатимуть методи створення онтологій, баз знань, експертних систем та систем підтримки прийняття рішень."
    },
    {
        "id" : 115,
        "name" : "Системи підтримки прийняття рішень (СППР)",
        "Description" : "Курс включає основи систем підтримки прийняття рішень (СППР), включаючи методи аналізу даних, моделювання, оптимізації та використання СППР у бізнесі. Студенти вивчатимуть інструменти для створення СППР, такі як Excel, Python та спеціалізоване програмне забезпечення."
    },
    {
        "id" : 116,
        "name" : "Розробка інтерфейсів користувача на React",
        "Description" : "Курс охоплює основи розробки інтерфейсів користувача на фреймворку React, включаючи принципи компонентного підходу, управління станом та роутинг. Студенти вивчатимуть використання React для створення інтерактивних та масштабованих веб-додатків, а також інструменти, такі як Redux та React Router."
    },
    {
        "id" : 117,
        "name" : "Системи управління конфігураціями",
        "Description" : "Курс включає основи систем управління конфігураціями (SCM), включаючи методи версіонування, автоматизації розгортання та забезпечення узгодженості систем. Студенти вивчатимуть використання інструментів для управління конфігураціями, таких як Git, Ansible та Puppet, для розробки та підтримки програмного забезпечення."
    },
    {
        "id" : 118,
        "name" : "Розробка мобільних додатків на React Native",
        "Description" : "Курс охоплює основи розробки мобільних додатків на платформі React Native, включаючи принципи компонентного підходу, управління станом та інтеграцію з нативними модулями. Студенти вивчатимуть використання React Native для створення кросплатформених мобільних додатків для iOS та Android."
    },
    {
        "id" : 119,
        "name" : "Розробка інтерактивних веб-додатків на Angular",
        "Description" : "Курс включає основи розробки інтерактивних веб-додатків на фреймворку Angular, включаючи принципи компонентного підходу, управління станом, роутинг та інтеграцію з серверними API. Студенти вивчатимуть використання Angular для створення сучасних веб-додатків з високою продуктивністю та масштабованістю."
    },
    {
        "id" : 120,
        "name" : "Квантове програмування на Q#",
        "Description" : "Курс присвячений основам квантового програмування на мові Q#, включаючи принципи квантової механіки, квантові алгоритми та розробку квантових програм. Студенти вивчатимуть використання Q# для створення та симуляції квантових алгоритмів, а також перспективи застосування квантових обчислень у різних галузях."
    },
    {
        "id" : 121,
        "name" : "Програмування на MATLAB",
        "Description" : "Курс включає основи програмування на платформі MATLAB, включаючи синтаксис, структури даних, математичне моделювання та симуляцію. Студенти вивчатимуть використання MATLAB для аналізу даних, розробки алгоритмів та моделювання систем у різних галузях, таких як інженерія, фізика та економіка."
    },
    {
        "id" : 122,
        "name" : "Системи управління проектами",
        "Description" : "Курс охоплює основи систем управління проектами, включаючи методи планування, управління ресурсами, контролю та оцінки ризиків. Студенти вивчатимуть використання інструментів для управління проектами, таких як Microsoft Project, JIRA та Trello, для ефективного управління проектами у різних галузях."
    },
    {
        "id" : 123,
        "name" : "Розробка ігрових додатків на Unity",
        "Description" : "Курс присвячений основам розробки ігрових додатків на платформі Unity, включаючи програмування, дизайн, анімацію та звукове оформлення. Студенти вивчатимуть використання Unity для створення інтерактивних та захоплюючих ігрових проектів для різних платформ, таких як ПК, консолі та мобільні пристрої."
    },
    {
        "id" : 124,
        "name" : "Програмування на C#",
        "Description" : "Курс включає основи програмування на мові C#, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку додатків на платформі .NET. Студенти вивчатимуть використання C# для створення десктопних, веб- та мобільних додатків з використанням сучасних фреймворків та інструментів."
    },
    {
        "id" : 125,
        "name" : "Системи управління інформаційною безпекою (СУІБ)",
        "Description" : "Курс охоплює основи систем управління інформаційною безпекою (СУІБ), включаючи принципи роботи, методи забезпечення безпеки та відповідність стандартам. Студенти вивчатимуть розробку політик безпеки, управління ризиками та проведення аудитів безпеки для захисту інформаційних систем."
    },
    {
        "id" : 126,
        "name" : "Розробка додатків на SwiftUI",
        "Description" : "Курс включає основи розробки додатків на фреймворку SwiftUI, включаючи принципи компонування, управління станом та створення адаптивних інтерфейсів користувача. Студенти вивчатимуть використання SwiftUI для створення сучасних додатків для платформ iOS та macOS."
    },
    {
        "id" : 127,
        "name" : "Автоматизація бізнес-процесів",
        "Description" : "Курс присвячений автоматизації бізнес-процесів, включаючи методи аналізу, оптимізації та автоматизації процесів для підвищення ефективності організації. Студенти вивчатимуть використання інструментів для автоматизації бізнес-процесів, таких як BPMN, RPA та спеціалізоване програмне забезпечення."
    },
    {
        "id" : 128,
        "name" : "Програмування на VHDL",
        "Description" : "Курс охоплює основи програмування на мові VHDL, включаючи синтаксис, моделювання та розробку апаратних рішень на базі ПЛІС (FPGA). Студенти вивчатимуть використання VHDL для проектування, симуляції та верифікації цифрових систем, а також застосування ПЛІС у різних галузях, таких як телекомунікації, автомобільна промисловість та авіація."
    },
    {
        "id" : 129,
        "name" : "Інженерія вимог",
        "Description" : "Курс включає основи інженерії вимог, включаючи методи збирання, аналізу, документування та управління вимогами для програмних проектів. Студенти вивчатимуть використання сучасних інструментів для управління вимогами, таких як JIRA та Confluence, а також методи забезпечення якості та узгодженості вимог."
    },
    {
        "id" : 130,
        "name" : "Системи розподіленого управління",
        "Description" : "Курс охоплює основи систем розподіленого управління, включаючи принципи роботи, архітектуру та методи розробки. Студенти вивчатимуть використання технологій для створення надійних та масштабованих систем розподіленого управління для різних галузей, таких як енергетика, промисловість та транспорт."
    },
    {
        "id" : 131,
        "name" : "Програмування на Erlang",
        "Description" : "Курс включає основи програмування на мові Erlang, включаючи синтаксис, структури даних, паралельне програмування та розробку розподілених систем. Студенти вивчатимуть використання Erlang для створення масштабованих та надійних розподілених додатків, а також її застосування у телекомунікаціях та фінансовій сфері."
    },
    {
        "id" : 132,
        "name" : "Технології DevOps",
        "Description" : "Курс присвячений основам технологій DevOps, включаючи методи автоматизації розгортання, забезпечення безперервної інтеграції та доставки, управління конфігураціями та моніторинг. Студенти вивчатимуть використання сучасних інструментів DevOps, таких як Docker, Kubernetes, Jenkins та Ansible, для оптимізації процесів розробки та експлуатації ПЗ."
    },
    {
        "id" : 133,
        "name" : "Програмування на Haskell",
        "Description" : "Курс охоплює основи програмування на мові Haskell, включаючи синтаксис, структури даних, функціональне програмування та розробку безпечних та ефективних програм. Студенти вивчатимуть використання Haskell для створення надійних програмних рішень, а також її застосування у фінансовій сфері, веб-розробці та аналізі даних."
    },
    {
        "id" : 134,
        "name" : "Технології розподілених обчислень",
        "Description" : "Курс включає основи технологій розподілених обчислень, включаючи архітектуру розподілених систем, методи забезпечення узгодженості та відмовостійкості, а також алгоритми розподілених обчислень. Студенти вивчатимуть використання сучасних платформ для розподілених обчислень, таких як Hadoop, Spark та Kubernetes, для вирішення складних обчислювальних задач."
    },
    {
        "id" : 135,
        "name" : "Програмування на Elixir",
        "Description" : "Курс присвячений основам програмування на мові Elixir, включаючи синтаксис, структури даних, паралельне програмування та розробку масштабованих розподілених систем. Студенти вивчатимуть використання Elixir для створення надійних додатків, а також її інтеграцію з платформою Erlang для розробки продуктивних рішень."
    },
    {
        "id" : 136,
        "name" : "Технології розробки чат-ботів",
        "Description" : "Курс охоплює основи технологій розробки чат-ботів, включаючи принципи роботи, архітектуру та використання штучного інтелекту для створення інтерактивних бото-систем. Студенти вивчатимуть використання платформ, таких як Dialogflow, Microsoft Bot Framework та Rasa, для розробки чат-ботів для різних застосувань, таких як підтримка клієнтів, автоматизація процесів та маркетинг."
    },
    {
        "id" : 137,
        "name" : "Системи управління виробництвом",
        "Description" : "Курс включає основи систем управління виробництвом, включаючи методи планування, управління ресурсами, контролю та оптимізації виробничих процесів. Студенти вивчатимуть використання сучасних інструментів та технологій для управління виробництвом, таких як ERP-системи, для підвищення ефективності та якості виробничих процесів."
    },
    {
        "id" : 138,
        "name" : "Програмування на F#",
        "Description" : "Курс присвячений основам програмування на мові F#, включаючи синтаксис, структури даних, функціональне програмування та розробку ефективних програм. Студенти вивчатимуть використання F# для створення надійних програмних рішень, а також її інтеграцію з платформою .NET для розробки масштабованих додатків."
    },
    {
        "id" : 139,
        "name" : "Інженерія інтернету речей (IoT)",
        "Description" : "Курс охоплює основи інженерії інтернету речей (IoT), включаючи методи збирання, обробки та аналізу даних з IoT-пристроїв. Студенти вивчатимуть розробку IoT-рішень для різних галузей, таких як розумні будинки, промислові автоматизовані системи та медичні пристрої, а також використання сучасних платформ IoT, таких як Azure IoT та AWS IoT."
    },
    {
        "id" : 140,
        "name" : "Розробка інтерфейсів користувача на Vue.js",
        "Description" : "Курс включає основи розробки інтерфейсів користувача на фреймворку Vue.js, включаючи принципи компонентного підходу, управління станом та роутинг. Студенти вивчатимуть використання Vue.js для створення інтерактивних та масштабованих веб-додатків, а також інструменти, такі як Vuex та Vue Router."
    },
    {
        "id" : 141,
        "name" : "Системи управління складськими запасами",
        "Description" : "Курс присвячений системам управління складськими запасами, включаючи методи планування, управління запасами та оптимізації складських операцій. Студенти вивчатимуть використання сучасних інструментів та технологій для управління складськими запасами, таких як WMS-системи, для підвищення ефективності та зниження витрат."
    },
    {
        "id" : 142,
        "name" : "Інженерія фінансових систем",
        "Description" : "Курс охоплює основи інженерії фінансових систем, включаючи методи розробки, аналізу та оптимізації фінансових процесів та систем. Студенти вивчатимуть використання сучасних інструментів та технологій для розробки фінансових систем, таких як блокчейн, фінансові API та платформи для електронних платежів."
    },
    {
        "id" : 143,
        "name" : "Технології безпеки веб-додатків",
        "Description" : "Курс включає основи технологій безпеки веб-додатків, включаючи методи захисту від атак, управління доступом та забезпечення цілісності даних. Студенти вивчатимуть сучасні загрози безпеці веб-додатків, такі як SQL-ін'єкції, XSS та CSRF, та методи їх нейтралізації для забезпечення безпеки веб-додатків."
    },
    {
        "id" : 144,
        "name" : "Програмування на Swift для iOS",
        "Description" : "Курс присвячений основам програмування на мові Swift для розробки додатків для платформи iOS, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку інтерфейсів користувача. Студенти вивчатимуть використання фреймворку SwiftUI та бібліотек iOS SDK для створення сучасних мобільних додатків."
    },
    {
        "id" : 145,
        "name" : "Системи управління контентом (CMS)",
        "Description" : "Курс охоплює основи систем управління контентом (CMS), включаючи методи розробки, налаштування та управління контентом для веб-сайтів. Студенти вивчатимуть використання популярних CMS, таких як WordPress, Joomla та Drupal, для створення масштабованих та зручних у користуванні веб-сайтів."
    },
    {
        "id" : 146,
        "name" : "Системи управління документообігом",
        "Description" : "Курс включає основи систем управління документообігом, включаючи методи збирання, збереження, обробки та управління документами. Студенти вивчатимуть використання сучасних інструментів для управління документообігом, таких як ECM-системи, для забезпечення ефективності та безпеки документальних процесів."
    },
    {
        "id" : 147,
        "name" : "Програмування на Julia",
        "Description" : "Курс присвячений основам програмування на мові Julia, включаючи синтаксис, структури даних, паралельне програмування та розробку наукових та обчислювальних додатків. Студенти вивчатимуть використання Julia для створення високопродуктивних програмних рішень, а також її застосування у галузях, таких як машинне навчання, статистика та чисельні методи."
    },
    {
        "id" : 148,
        "name" : "Системи управління інформаційними потоками",
        "Description" : "Курс охоплює основи систем управління інформаційними потоками, включаючи методи збирання, збереження, обробки та розповсюдження інформації у великих організаціях. Студенти вивчатимуть використання сучасних інструментів та технологій для управління інформаційними потоками, таких як системи управління документами (DMS) та системи управління контентом (CMS)."
    },
    {
        "id" : 149,
        "name" : "Технології вбудованих систем",
        "Description" : "Курс включає основи технологій вбудованих систем, включаючи методи проектування, програмування та тестування вбудованих рішень. Студенти вивчатимуть використання сучасних платформ для розробки вбудованих систем, таких як Arduino, Raspberry Pi та ESP8266, для створення ефективних та надійних вбудованих рішень."
    },
    {
        "id" : 150,
        "name" : "Розробка доповненої реальності (AR)",
        "Description" : "Курс присвячений основам розробки додатків доповненої реальності (AR), включаючи принципи роботи, архітектуру та технології для створення інтерактивних AR-додатків. Студенти вивчатимуть використання платформ, таких як ARKit, ARCore та Vuforia, для створення додатків доповненої реальності для різних пристроїв та платформ."
    },
    {
        "id" : 151,
        "name" : "Технології машинного навчання для аналізу даних",
        "Description" : "Курс охоплює основи технологій машинного навчання для аналізу даних, включаючи методи збирання, збереження, обробки та аналізу великих обсягів даних. Студенти вивчатимуть використання сучасних інструментів та технологій для аналізу даних, таких як Python, R та Spark, для створення моделей машинного навчання та їх застосування у різних галузях."
    },
    {
        "id" : 152,
        "name" : "Програмування на Objective-C",
        "Description" : "Курс включає основи програмування на мові Objective-C, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку додатків для платформи iOS. Студенти вивчатимуть використання Objective-C для створення сучасних додатків для iOS, а також її інтеграцію з фреймворками, такими як Cocoa Touch."
    },
    {
        "id" : 153,
        "name" : "Інженерія вимірювальних систем",
        "Description" : "Курс присвячений основам інженерії вимірювальних систем, включаючи методи збирання, обробки та аналізу вимірювальних даних. Студенти вивчатимуть використання сучасних інструментів та технологій для розробки вимірювальних систем, таких як сенсори, інтерфейси та програмне забезпечення для вимірювань."
    },
    {
        "id" : 154,
        "name" : "Розробка інтелектуальних агентів",
        "Description" : "Курс охоплює основи розробки інтелектуальних агентів, включаючи принципи роботи, архітектуру та методи штучного інтелекту для створення автономних агентів. Студенти вивчатимуть використання сучасних інструментів та технологій для розробки інтелектуальних агентів, таких як машинне навчання, нейронні мережі та алгоритми оптимізації."
    },
    {
        "id" : 155,
        "name" : "Системи керування та автоматики",
        "Description" : "Курс включає основи систем керування та автоматики, включаючи методи проектування, розробки та налаштування автоматизованих систем керування. Студенти вивчатимуть використання сучасних інструментів та технологій для створення систем керування, таких як PLC, SCADA та HMI, для забезпечення ефективності та надійності автоматизованих процесів."
    },
    {
        "id" : 156,
        "name" : "Програмування на Rust для системного програмування",
        "Description" : "Курс присвячений основам програмування на мові Rust для системного програмування, включаючи синтаксис, структури даних, управління пам'яттю та розробку безпечних системних рішень. Студенти вивчатимуть використання Rust для створення ефективних та надійних системних програм, а також її інтеграцію з іншими мовами та платформами."
    },
    {
        "id" : 157,
        "name" : "Інженерія медичних систем",
        "Description" : "Курс охоплює основи інженерії медичних систем, включаючи методи розробки, аналізу та оптимізації медичних пристроїв та систем. Студенти вивчатимуть використання сучасних інструментів та технологій для розробки медичних систем, таких як сенсори, інтерфейси та програмне забезпечення для медичних додатків."
    },
    {
        "id" : 158,
        "name" : "Програмування на Kotlin для Android",
        "Description" : "Курс включає основи програмування на мові Kotlin для розробки додатків для платформи Android, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку інтерфейсів користувача. Студенти вивчатимуть використання Kotlin для створення сучасних додатків для Android, а також її інтеграцію з бібліотеками Android SDK."
    },
    {
        "id" : 159,
        "name" : "Системи управління даними (DMS)",
        "Description" : "Курс присвячений основам систем управління даними (DMS), включаючи методи збирання, збереження, обробки та управління даними. Студенти вивчатимуть використання сучасних інструментів та технологій для управління даними, таких як реляційні та нереляційні бази даних, системи управління документами та сховища даних."
    },
    {
        "id" : 160,
        "name" : "Технології розробки ігор на Unreal Engine",
        "Description" : "Курс охоплює основи технологій розробки ігор на платформі Unreal Engine, включаючи програмування, дизайн, анімацію та звукове оформлення. Студенти вивчатимуть використання Unreal Engine для створення інтерактивних та захоплюючих ігрових проектів для різних платформ, таких як ПК, консолі та мобільні пристрої."
    },
    {
        "id" : 161,
        "name" : "Програмування на Perl",
        "Description" : "Курс включає основи програмування на мові Perl, включаючи синтаксис, структури даних, обробку тексту та розробку сценаріїв для автоматизації завдань. Студенти вивчатимуть використання Perl для створення ефективних програмних рішень, а також її застосування у галузях, таких як біоінформатика, системне адміністрування та веб-розробка."
    },
    {
        "id" : 162,
        "name" : "Розробка додатків для інтернету речей (IoT)",
        "Description" : "Курс присвячений основам розробки додатків для інтернету речей (IoT), включаючи принципи роботи, архітектуру та технології для створення інтерактивних IoT-додатків. Студенти вивчатимуть використання сучасних платформ для розробки IoT-рішень, таких як Arduino, Raspberry Pi та ESP8266, для створення ефективних та надійних IoT-додатків."
    },
    {
        "id" : 163,
        "name" : "Технології біоінформатики",
        "Description" : "Курс охоплює основи технологій біоінформатики, включаючи методи збирання, збереження, обробки та аналізу біологічних даних. Студенти вивчатимуть використання сучасних інструментів та технологій для аналізу біоінформатичних даних, таких як секвенування ДНК, аналіз геномів та моделювання біологічних систем."
    },
    {
        "id" : 164,
        "name" : "Програмування на Groovy",
        "Description" : "Курс включає основи програмування на мові Groovy, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку сценаріїв для автоматизації завдань. Студенти вивчатимуть використання Groovy для створення ефективних програмних рішень, а також її застосування у галузях, таких як тестування, системне адміністрування та веб-розробка."
    },
    {
        "id" : 165,
        "name" : "Інженерія розподілених систем",
        "Description" : "Курс присвячений основам інженерії розподілених систем, включаючи принципи роботи, архітектуру та методи розробки. Студенти вивчатимуть використання сучасних інструментів та технологій для створення надійних та масштабованих розподілених систем для різних галузей, таких як хмарні обчислення, великі дані та телекомунікації."
    },
    {
        "id" : 166,
        "name" : "Розробка додатків на Flutter",
        "Description" : "Курс охоплює основи розробки додатків на платформі Flutter, включаючи програмування на мові Dart, створення інтерфейсів користувача та інтеграцію з нативними модулями. Студенти вивчатимуть використання Flutter для створення кросплатформених мобільних додатків для iOS та Android."
    },
    {
        "id" : 167,
        "name" : "Програмування на Shell",
        "Description" : "Курс включає основи програмування на мові Shell, включаючи синтаксис, структури даних, обробку тексту та розробку сценаріїв для автоматизації завдань. Студенти вивчатимуть використання Shell для створення ефективних програмних рішень, а також її застосування у галузях, таких як системне адміністрування, розробка та автоматизація завдань."
    },
    {
        "id" : 168,
        "name" : "Технології доповненої реальності (AR)",
        "Description" : "Курс присвячений основам технологій доповненої реальності (AR), включаючи принципи роботи, архітектуру та технології для створення інтерактивних AR-додатків. Студенти вивчатимуть використання платформ, таких як ARKit, ARCore та Vuforia, для створення додатків доповненої реальності для різних пристроїв та платформ."
    },
    {
        "id" : 169,
        "name" : "Програмування на PowerShell",
        "Description" : "Курс охоплює основи програмування на мові PowerShell, включаючи синтаксис, структури даних, обробку тексту та розробку сценаріїв для автоматизації завдань. Студенти вивчатимуть використання PowerShell для створення ефективних програмних рішень, а також її застосування у галузях, таких як системне адміністрування, розробка та автоматизація завдань."
    },
    {
        "id" : 170,
        "name" : "Системи інтернету речей (IoT)",
        "Description" : "Курс включає основи систем інтернету речей (IoT), включаючи методи збирання, збереження, обробки та аналізу даних з IoT-пристроїв. Студенти вивчатимуть розробку IoT-рішень для різних галузей, таких як розумні будинки, промислові автоматизовані системи та медичні пристрої, а також використання сучасних платформ IoT, таких як Azure IoT та AWS IoT."
    },
    {
        "id" : 171,
        "name" : "Розробка графічних інтерфейсів на JavaFX",
        "Description" : "Курс охоплює основи розробки графічних інтерфейсів користувача на платформі JavaFX, включаючи принципи компонування, управління станом та інтеграцію з іншими технологіями Java. Студенти вивчатимуть використання JavaFX для створення сучасних та інтерактивних графічних інтерфейсів для десктопних додатків."
    },
    {
        "id" : 172,
        "name" : "Системи управління енергетичними ресурсами",
        "Description" : "Курс присвячений системам управління енергетичними ресурсами, включаючи методи планування, управління ресурсами та оптимізації енергетичних процесів. Студенти вивчатимуть використання сучасних інструментів та технологій для управління енергетичними ресурсами, таких як системи управління енергією (EMS) та смарт-мережі."
    },
    {
        "id" : 173,
        "name" : "Інженерія інформаційних систем",
        "Description" : "Курс включає основи інженерії інформаційних систем, включаючи методи проектування, розробки та впровадження інформаційних систем для різних галузей. Студенти вивчатимуть використання сучасних інструментів та технологій для створення ефективних та надійних інформаційних систем, таких як бази даних, сховища даних та системи управління контентом."
    },
    {
        "id" : 174,
        "name" : "Програмування на COBOL",
        "Description" : "Курс охоплює основи програмування на мові COBOL, включаючи синтаксис, структури даних, обробку тексту та розробку програм для бізнес-застосувань. Студенти вивчатимуть використання COBOL для створення ефективних програмних рішень, а також її застосування у галузях, таких як фінанси, банківська справа та урядові системи."
    },
    {
        "id" : 175,
        "name" : "Технології системного адміністрування",
        "Description" : "Курс включає основи технологій системного адміністрування, включаючи методи налаштування, управління та забезпечення безпеки серверних та мережевих систем. Студенти вивчатимуть використання сучасних інструментів та технологій для системного адміністрування, таких як Active Directory, Linux та Windows Server."
    },
    {
        "id" : 176,
        "name" : "Програмування на Lua",
        "Description" : "Курс присвячений основам програмування на мові Lua, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку сценаріїв для автоматизації завдань. Студенти вивчатимуть використання Lua для створення ефективних програмних рішень, а також її застосування у галузях, таких як ігрова розробка, веб-розробка та системне адміністрування."
    },
    {
        "id" : 177,
        "name" : "Системи автоматизації виробництва",
        "Description" : "Курс охоплює основи систем автоматизації виробництва, включаючи методи проектування, налаштування та управління автоматизованими виробничими системами. Студенти вивчатимуть використання сучасних інструментів та технологій для автоматизації виробництва, таких як робототехніка, PLC та SCADA-системи."
    },
    {
        "id" : 178,
        "name" : "Програмування на Fortran",
        "Description" : "Курс включає основи програмування на мові Fortran, включаючи синтаксис, структури даних, обробку тексту та розробку наукових та обчислювальних додатків. Студенти вивчатимуть використання Fortran для створення високопродуктивних програмних рішень, а також її застосування у галузях, таких як фізика, інженерія та чисельні методи."
    },
    {
        "id" : 179,
        "name" : "Технології управління ланцюгами постачання (SCM)",
        "Description" : "Курс присвячений технологіям управління ланцюгами постачання (SCM), включаючи методи планування, управління ресурсами та оптимізації логістичних процесів. Студенти вивчатимуть використання сучасних інструментів та технологій для управління ланцюгами постачання, таких як ERP-системи, для підвищення ефективності та якості логістичних процесів."
    },
    {
        "id" : 180,
        "name" : "Програмування на Smalltalk",
        "Description" : "Курс охоплює основи програмування на мові Smalltalk, включаючи синтаксис, структури даних, об'єктно-орієнтоване програмування та розробку програмних рішень. Студенти вивчатимуть використання Smalltalk для створення ефективних програмних рішень, а також її застосування у галузях, таких як веб-розробка, наукові дослідження та навчання програмуванню."
    },
    {
        "id" : 181,
        "name" : "Розробка додатків на Xamarin",
        "Description" : "Курс включає основи розробки додатків на платформі Xamarin, включаючи програмування на мові C#, створення інтерфейсів користувача та інтеграцію з нативними модулями. Студенти вивчатимуть використання Xamarin для створення кросплатформених мобільних додатків для iOS та Android."
    },
    {
        "id" : 182,
        "name" : "Програмування на BASIC",
        "Description" : "Курс присвячений основам програмування на мові BASIC, включаючи синтаксис, структури даних, обробку тексту та розробку програмних рішень. Студенти вивчатимуть використання BASIC для створення ефективних програмних рішень, а також її застосування у галузях, таких як навчання програмуванню, розробка ігор та автоматизація завдань."
    },
    {
        "id" : 183,
        "name" : "Технології хмарних обчислень",
        "Description" : "Курс охоплює основи технологій хмарних обчислень, включаючи методи розробки, налаштування та управління хмарними інфраструктурами. Студенти вивчатимуть використання сучасних інструментів та платформ для хмарних обчислень, таких як AWS, Azure та Google Cloud, для створення масштабованих та надійних хмарних рішень."
    },
    {
        "id" : 184,
        "name" : "Програмування на VBA",
        "Description" : "Курс включає основи програмування на мові Visual Basic for Applications (VBA), включаючи синтаксис, структури даних, обробку тексту та розробку сценаріїв для автоматизації завдань у програмах Microsoft Office. Студенти вивчатимуть використання VBA для створення ефективних програмних рішень, а також її застосування у галузях, таких як автоматизація офісних процесів, аналіз даних та створення звітів."
    },
    {
        "id" : 185,
        "name" : "Розробка додатків для блокчейну",
        "Description" : "Курс присвячений основам розробки додатків для блокчейну, включаючи принципи роботи, архітектуру та технології для створення блокчейн-додатків. Студенти вивчатимуть використання сучасних платформ для розробки блокчейн-рішень, таких як Ethereum, Hyperledger та Corda, для створення децентралізованих додатків та смарт-контрактів."
    },
    {
        "id" : 186,
        "name" : "Програмування на Assembly",
        "Description" : "Курс охоплює основи програмування на мові асемблера (Assembly), включаючи синтаксис, структури даних, обробку тексту та розробку низькорівневих програмних рішень. Студенти вивчатимуть використання Assembly для створення ефективних системних програм, а також її застосування у галузях, таких як розробка операційних систем, драйверів та вбудованих систем."
    },
    {
        "id" : 187,
        "name" : "Технології штучного інтелекту для бізнесу",
        "Description" : "Курс включає основи технологій штучного інтелекту для бізнесу, включаючи методи збирання, збереження, обробки та аналізу даних для прийняття бізнес-рішень. Студенти вивчатимуть використання сучасних інструментів та технологій для аналізу даних, таких як машинне навчання, нейронні мережі та алгоритми оптимізації, для створення моделей штучного інтелекту та їх застосування у різних галузях бізнесу."
    },
    {
        "id" : 188,
        "name" : "Розробка додатків на Ruby on Rails",
        "Description" : "Курс присвячений основам розробки додатків на фреймворку Ruby on Rails, включаючи принципи роботи, архітектуру та технології для створення веб-додатків. Студенти вивчатимуть використання Ruby on Rails для створення масштабованих та надійних веб-додатків, а також її інтеграцію з іншими технологіями, такими як JavaScript та бази даних."
    },
    {
        "id" : 189,
        "name" : "Програмування на Ada",
        "Description" : "Курс охоплює основи програмування на мові Ada, включаючи синтаксис, структури даних, обробку тексту та розробку програмних рішень. Студенти вивчатимуть використання Ada для створення ефективних програмних рішень, а також її застосування у галузях, таких як авіоніка, космічна техніка та військові системи."
    },
    {
        "id" : 190,
        "name" : "Системи управління базами даних (СУБД)",
        "Description" : "Курс включає основи систем управління базами даних (СУБД), включаючи методи проектування, створення, адміністрування та оптимізації баз даних. Студенти вивчатимуть реляційні та нереляційні моделі даних, мови запитів SQL та NoSQL, а також методи забезпечення цілісності та безпеки даних."
    },
    {
        "id" : 191,
        "name" : "Програмування на OCaml",
        "Description" : "Курс присвячений основам програмування на мові OCaml, включаючи синтаксис, структури даних, функціональне програмування та розробку програмних рішень. Студенти вивчатимуть використання OCaml для створення ефективних програмних рішень, а також її застосування у галузях, таких як аналіз даних, веб-розробка та наукові дослідження."
    },
    {
        "id" : 192,
        "name" : "Технології управління ризиками",
        "Description" : "Курс охоплює основи технологій управління ризиками, включаючи методи аналізу, оцінки та управління ризиками для різних галузей. Студенти вивчатимуть використання сучасних інструментів та технологій для управління ризиками, таких як програмне забезпечення для аналізу ризиків, моделі ризик-менеджменту та методи оцінки ризиків."
    },
    {
        "id" : 193,
        "name" : "Розробка додатків на Django",
        "Description" : "Курс включає основи розробки додатків на фреймворку Django, включаючи принципи роботи, архітектуру та технології для створення веб-додатків. Студенти вивчатимуть використання Django для створення масштабованих та надійних веб-додатків, а також її інтеграцію з іншими технологіями, такими як JavaScript та бази даних."
    },
    {
        "id" : 194,
        "name" : "Програмування на Prolog",
        "Description" : "Курс присвячений основам програмування на мові Prolog, включаючи синтаксис, структури даних, логічне програмування та розробку інтелектуальних систем. Студенти вивчатимуть використання Prolog для створення ефективних програмних рішень, а також її застосування у галузях, таких як штучний інтелект, експертні системи та аналіз даних."
    },
    {
        "id" : 195,
        "name" : "Системи управління фінансовими ризиками",
        "Description" : "Курс охоплює основи систем управління фінансовими ризиками, включаючи методи аналізу, оцінки та управління фінансовими ризиками для різних галузей. Студенти вивчатимуть використання сучасних інструментів та технологій для управління фінансовими ризиками, таких як програмне забезпечення для аналізу ризиків, моделі фінансового ризик-менеджменту та методи оцінки фінансових ризиків."
    },
    {
        "id" : 196,
        "name" : "Розробка додатків на Flask",
        "Description" : "Курс включає основи розробки додатків на мікрофреймворку Flask, включаючи принципи роботи, архітектуру та технології для створення веб-додатків. Студенти вивчатимуть використання Flask для створення масштабованих та надійних веб-додатків, а також її інтеграцію з іншими технологіями, такими як JavaScript та бази даних."
    },
    {
        "id" : 197,
        "name" : "Програмування на Racket",
        "Description" : "Курс присвячений основам програмування на мові Racket, включаючи синтаксис, структури даних, функціональне програмування та розробку програмних рішень. Студенти вивчатимуть використання Racket для створення ефективних програмних рішень, а також її застосування у галузях, таких як аналіз даних, веб-розробка та наукові дослідження."
    },
    {
        "id" : 198,
        "name" : "Системи управління ризиками проектів",
        "Description" : "Курс охоплює основи систем управління ризиками проектів, включаючи методи аналізу, оцінки та управління ризиками для різних проектів. Студенти вивчатимуть використання сучасних інструментів та технологій для управління ризиками проектів, таких як програмне забезпечення для аналізу ризиків, моделі ризик-менеджменту та методи оцінки ризиків проектів."
    },
    {
        "id" : 199,
        "name" : "Розробка додатків на Laravel",
        "Description" : "Курс включає основи розробки додатків на фреймворку Laravel, включаючи принципи роботи, архітектуру та технології для створення веб-додатків. Студенти вивчатимуть використання Laravel для створення масштабованих та надійних веб-додатків, а також її інтеграцію з іншими технологіями, такими як JavaScript та бази даних."
    },
    {
        "id" : 200,
        "name" : "Програмування на Scheme",
        "Description" : "Курс присвячений основам програмування на мові Scheme, включаючи синтаксис, структури даних, функціональне програмування та розробку програмних рішень. Студенти вивчатимуть використання Scheme для створення ефективних програмних рішень, а також її застосування у галузях, таких як аналіз даних, веб-розробка та наукові дослідження."
    }
]